In [14]:
import prettytable
import sqlite3
import pandas as pd
import prettytable
prettytable.DEFAULT = 'DEFAULT'
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [12]:
connection = sqlite3.connect('db_sandbox.db')
%sql sqlite:///db_sandbox.db

### Problem 1
Find the total number of crimes recorded in the CRIME table.

In [17]:
%sql SELECT COUNT(*) FROM ChicagoCrimeData

 * sqlite:///db_sandbox.db
Done.

[(533,)]

### Problem 2
List community area names and numbers with per capita income less than 11000.

In [24]:
%%sql 
SELECT * FROM PRAGMA_TABLE_INFO('socioeconomicChicago') 
    where name like '%capita%'
    OR name like '%name%'
    OR name like '%number%'

 * sqlite:///db_sandbox.db
Done.

[(0, 'COMMUNITY_AREA_NUMBER', 'REAL', 0, None, 0),
 (1, 'COMMUNITY_AREA_NAME', 'TEXT', 0, None, 0),
 (7, 'PER_CAPITA_INCOME', 'INTEGER', 0, None, 0)]

In [25]:
%%sql 
SELECT 
    COMMUNITY_AREA_NAME,
    COMMUNITY_AREA_NUMBER, 
    PER_CAPITA_INCOME
FROM socioeconomicChicago
WHERE PER_CAPITA_INCOME < 11000

 * sqlite:///db_sandbox.db
Done.

[('West Garfield Park', 26.0, 10934),
 ('South Lawndale', 30.0, 10402),
 ('Fuller Park', 37.0, 10432),
 ('Riverdale', 54.0, 8201)]

### Problem 3
List all case numbers for crimes involving minors?(children are not considered minors for the purposes of crime analysis)

In [32]:
%%sql 
SELECT * FROM PRAGMA_TABLE_INFO('chicagoCrimeData') LIMIT 5

 * sqlite:///db_sandbox.db
Done.

[(0, 'ID', 'INTEGER', 0, None, 0),
 (1, 'CASE_NUMBER', 'VARCHAR(50)', 0, None, 0),
 (2, 'DATE', 'NVARCHAR(50)', 0, None, 0),
 (3, 'BLOCK', 'NVARCHAR(50)', 0, None, 0),
 (4, 'IUCR', 'INTEGER', 0, None, 0)]

In [37]:
%%sql 
SELECT 
    *
FROM chicagoCrimeData
WHERE UPPER(DESCRIPTION) LIKE '%MINOR%'
OR UPPER(PRIMARY_TYPE) LIKE '%MINOR%'

 * sqlite:///db_sandbox.db
Done.

[(3987219, 'HL266884', '2005-03-31', '024XX N CLARK ST', 2210, 'LIQUOR LAW VIOLATION', 'SELL/GIVE/DEL LIQUOR TO MINOR', 'CONVENIENCE STORE', 'TRUE', 'FALSE', 2333, 19, 43, 7, 22, 1172680, 1916483, 2005, 41.92626872, -87.64089934, '(41.926268719, -87.640899336)'),
 (3266814, 'HK238408', '2004-03-13', '093XX S STONY ISLAND AVE', 2230, 'LIQUOR LAW VIOLATION', 'ILLEGAL CONSUMPTION BY MINOR', 'ALLEY', 'TRUE', 'FALSE', 413, 4, 8, 48, 22, 1188539, 1843379, 2004, 41.72530099, -87.58496589, '(41.72530099, -87.584965887)')]

### Problem 4
List all kidnapping crimes involving a child?

In [35]:
%%sql 
SELECT 
    *
FROM chicagoCrimeData
WHERE 
    UPPER(DESCRIPTION) LIKE '%CHILD%'
    AND UPPER(PRIMARY_TYPE) LIKE '%KIDNAP%'

 * sqlite:///db_sandbox.db
Done.

[(5276766, 'HN144152', '2007-01-26', '050XX W VAN BUREN ST', 1792, 'KIDNAPPING', 'CHILD ABDUCTION/STRANGER', 'STREET', 'FALSE', 'FALSE', 1533, 15, 29, 25, 20, 1143050, 1897546, 2007, 41.87490841, -87.75024931, '(41.874908413, -87.750249307)')]

### Problem 5
List the kind of crimes that were recorded at schools. (No repetitions)

In [41]:
%%sql 
SELECT DISTINCT
    PRIMARY_TYPE
FROM chicagoCrimeData
WHERE 
    LOCATION_DESCRIPTION LIKE '%SCHOOL%'

 * sqlite:///db_sandbox.db
Done.

[('BATTERY',),
 ('CRIMINAL DAMAGE',),
 ('NARCOTICS',),
 ('ASSAULT',),
 ('CRIMINAL TRESPASS',),
 ('PUBLIC PEACE VIOLATION',)]

### Problem 6
List the type of schools along with the average safety score for each type.

In [44]:
%%sql 
SELECT * FROM PRAGMA_TABLE_INFO('ChicagoPublicSchools') 
    where name like '%safety%'
    OR name like '%name%'
    OR name like '%school%'

 * sqlite:///db_sandbox.db
Done.

[(0, 'School_ID', 'INTEGER', 0, None, 0),
 (1, 'NAME_OF_SCHOOL', 'VARCHAR(64)', 0, None, 0),
 (2, 'Elementary, Middle, or High School', 'VARCHAR(50)', 0, None, 0),
 (10, 'Collaborative_Name', 'VARCHAR(50)', 0, None, 0),
 (15, 'HEALTHY_SCHOOL_CERTIFIED', 'VARCHAR(50)', 0, None, 0),
 (16, 'Safety_Icon', 'VARCHAR(50)', 0, None, 0),
 (17, 'SAFETY_SCORE', 'INTEGER', 0, None, 0),
 (74, 'COMMUNITY_AREA_NAME', 'VARCHAR(50)', 0, None, 0)]

In [78]:
%%sql 
SELECT 
    `Elementary, Middle, or High School` AS SCHOOL_TYPE,
    ROUND(AVG(SAFETY_SCORE),3) AS AVG_SAFETY_SCORE

FROM ChicagoPublicSchools
GROUP BY SCHOOL_TYPE

 * sqlite:///db_sandbox.db
Done.

[('ES', 44.697), ('HS', 45.355), ('MS', 48.0)]

### Problem 7
List 5 community areas with highest % of households below poverty line

In [52]:
%%sql 
SELECT * FROM PRAGMA_TABLE_INFO('socioeconomicChicago') 
    where name like '%number%'
    OR name like '%name%'
    OR name like '%poverty%'

 * sqlite:///db_sandbox.db
Done.

[(0, 'COMMUNITY_AREA_NUMBER', 'REAL', 0, None, 0),
 (1, 'COMMUNITY_AREA_NAME', 'TEXT', 0, None, 0),
 (3, 'PERCENT_HOUSEHOLDS_BELOW_POVERTY', 'REAL', 0, None, 0)]

In [54]:
%%sql 
SELECT 
    COMMUNITY_AREA_NUMBER,
    COMMUNITY_AREA_NAME,
    PERCENT_HOUSEHOLDS_BELOW_POVERTY
FROM socioeconomicChicago
ORDER BY PERCENT_HOUSEHOLDS_BELOW_POVERTY DESC
LIMIT 5

 * sqlite:///db_sandbox.db
Done.

[(54.0, 'Riverdale', 56.5),
 (37.0, 'Fuller Park', 51.2),
 (68.0, 'Englewood', 46.6),
 (29.0, 'North Lawndale', 43.1),
 (27.0, 'East Garfield Park', 42.4)]

### Problem 8
Which community area is most crime prone? Display the coumminty area number only.

In [66]:
%%sql
SELECT
    COMMUNITY_AREA_NUMBER,
    CRIME_NUMBER

FROM (
    SELECT 
        COMMUNITY_AREA_NUMBER,
        COUNT(COMMUNITY_AREA_NUMBER) AS CRIME_NUMBER
    FROM ChicagoCrimeData
    GROUP BY COMMUNITY_AREA_NUMBER
    ORDER BY CRIME_NUMBER DESC
) LIMIT 6

 * sqlite:///db_sandbox.db
Done.

[('', 43), (25, 43), (23, 22), (68, 21), (29, 16), (28, 16)]

### Problem 9
Use a sub-query to find the name of the community area with highest hardship index

In [68]:
%%sql 
SELECT * FROM PRAGMA_TABLE_INFO('socioeconomicChicago') 
    where name like '%hardship%'
    or name like '%community%'

 * sqlite:///db_sandbox.db
Done.

[(0, 'COMMUNITY_AREA_NUMBER', 'REAL', 0, None, 0),
 (1, 'COMMUNITY_AREA_NAME', 'TEXT', 0, None, 0),
 (8, 'HARDSHIP_INDEX', 'REAL', 0, None, 0)]

In [69]:
%%sql
SELECT 
    COMMUNITY_AREA_NAME
FROM (
    SELECT 
        COMMUNITY_AREA_NUMBER,
        COMMUNITY_AREA_NAME,
        HARDSHIP_INDEX
    FROM socioeconomicChicago
    ORDER BY HARDSHIP_INDEX DESC
) LIMIT 1

 * sqlite:///db_sandbox.db
Done.

[('Riverdale',)]

### Problem 10
Use a sub-query to determine the Community Area Name with most number of crimes?

In [76]:
%%sql
SELECT
    crime.COMMUNITY_AREA_NUMBER,
    socio.COMMUNITY_AREA_NAME,
    crime.CRIME_NUMBER

FROM (
    SELECT 
        COMMUNITY_AREA_NUMBER,
        COUNT(COMMUNITY_AREA_NUMBER) AS CRIME_NUMBER
    FROM ChicagoCrimeData
    GROUP BY COMMUNITY_AREA_NUMBER
    ORDER BY CRIME_NUMBER DESC
) AS crime
INNER JOIN socioeconomicChicago AS socio
ON crime.COMMUNITY_AREA_NUMBER = socio.COMMUNITY_AREA_NUMBER
ORDER BY crime.CRIME_NUMBER DESC

 * sqlite:///db_sandbox.db
Done.

[(25, 'Austin', 43),
 (23, 'Humboldt park', 22),
 (68, 'Englewood', 21),
 (28, 'Near West Side', 16),
 (29, 'North Lawndale', 16),
 (8, 'Near North Side', 15),
 (71, 'Auburn Gresham', 14),
 (24, 'West Town', 13),
 (66, 'Chicago Lawn', 12),
 (67, 'West Englewood', 12),
 (6, 'Lake View', 11),
 (49, 'Roseland', 11),
 (69, 'Greater Grand Crossing', 11),
 (26, 'West Garfield Park', 10),
 (58, 'Brighton Park', 10),
 (61, 'New City', 10),
 (22, 'Logan Square', 9),
 (31, 'Lower West Side', 9),
 (43, 'South Shore', 9),
 (46, 'South Chicago', 9),
 (16, 'Irving Park', 8),
 (19, 'Belmont Cragin', 8),
 (27, 'East Garfield Park', 8),
 (30, 'South Lawndale', 8),
 (38, 'Grand Boulevard', 8),
 (42, 'Woodlawn', 8),
 (44, 'Chatham', 8),
 (70, 'Ashburn', 8),
 (2, 'West Ridge', 7),
 (32, 'Loop', 7),
 (63, 'Gage Park', 7),
 (1, 'Rogers Park', 6),
 (21, 'Avondale', 6),
 (53, 'West Pullman', 6),
 (7, 'Lincoln Park', 5),
 (14, 'Albany Park', 5),
 (15, 'Portage Park', 5),
 (35, 'Douglas', 5),
 (48, 'Calumet Heights', 5),
 (3, 'Uptown', 4),
 (5, 'North Center', 4),
 (39, 'Kenwood', 4),
 (45, 'Avalon Park', 4),
 (51, 'South Deering', 4),
 (62, 'West Elsdon', 4),
 (72, 'Beverly', 4),
 (76, "O'Hare", 4),
 (4, 'Lincoln Square', 3),
 (10, 'Norwood Park', 3),
 (17, 'Dunning', 3),
 (20, 'Hermosa', 3),
 (50, 'Pullman', 3),
 (65, 'West Lawn', 3),
 (73, 'Washington Height', 3),
 (11, 'Jefferson Park', 2),
 (18, 'Montclaire', 2),
 (37, 'Fuller Park', 2),
 (41, 'Hyde Park', 2),
 (52, 'East Side', 2),
 (54, 'Riverdale', 2),
 (56, 'Garfield Ridge', 2),
 (59, 'McKinley Park', 2),
 (64, 'Clearing', 2),
 (77, 'Edgewater', 2),
 (12, 'Forest Glen', 1),
 (33, 'Near South Side', 1),
 (47, 'Burnside', 1),
 (55, 'Hegewisch', 1),
 (60, 'Bridgeport', 1),
 (75, 'Morgan Park', 1)]